[
    {
        "match":"ask(?set([goal(perform(french_omelette)), goal(perform(caesar_salad))]))",
        "utterance": "Do you want to make a french omelette or a caesar salad?|What would you like to do?"
    },

    {
        "match": "icm:loadplan",
        "utterance": "Let's see..."
    },

    {
        "match": "request(crack_eggs)",
        "utterance": "Crack three eggs on a bowl and whisk with a pinch of salt."
    },

    {
        "match": "request(add_butter)",
        "utterance": "Heat butter or oil on a pan on high heat."
    },

    {
        "match": "request(stir_eggs)",
        "utterance": "Add the egg mixture to the pan and stir the eggs for about 30 seconds."
    },

    {
        "match": "request(fold_omelette)",
        "utterance": "When the eggs are set but look slightly wet, turn off the heat and fold the omelette."
    },

    {
        "match": "request(into_plate)",
        "utterance": "After a few seconds, transfer the omelette onto a plate."
    },

    {
        "match": "request(hold_fork)",
        "utterance": " Hold a fork flat on the pan and stir the eggs thoroughly with one hand while shaking the pan back and forth with the other."
    },

    {
        "match": "request(edges)",
        "utterance": " Keep incorporating the set edges into the runny center. This takes just 25 to 30 seconds."
    },

    {
        "match": "request(rinse_chicken)",
        "utterance": "First you need to bring a chicken breast and rinse it."
    },
    
    {
        "match": "request(prepare_grill)",
        "utterance": "then you will put a baking paper on a heated grill and a little of olive oil or butter until it melts and sprinkle some salt, black pepper and on top of it."
    },
    
    {
        "match": "request(cook_chicken)",
        "utterance": " put the chicken breast on the grill and sprinkle the spices on top of it. Let it cook for almost 15 minutes on each side."
    },
    
    {
        "match": "request(toast_bread)",
        "utterance": "toast the bread and then cut both the toast and the chicken breast."
    },

    {
        "match": "request(add_sauce)",
        "utterance": "get the caesar sauce ready to add it later."
    },
    
    {
        "match": "request(mix_all)",
        "utterance": "cut the lettuce, add to it some caesar sauce and mix with the chicken breast and the toast then add one spoon of olive oil, and don't forget the parmesan cheese on top."
    },

    {
        "match": "request(shape)",
        "utterance": "cut them to medium-sized cubes, the chicken breast could also be cut horizontally into 2 halves and then into slices"
    },

    {
        "match": "request(sauce_option)",
        "utterance": "you can either buy the caesar sauce or prepare it at home."
    },

    {
        "match": "request(prepare_sauce)",
        "utterance": "add mayonnaise, garlic, a pinch of salt, lemon juice, dijon and worcestershire sauce and mix them together then add some black pepper and thin the mix with a table spoon of water."
    },

        {
        "match": "report(action_status(stir_eggs, done))",
        "utterance": "Great! let's continue then."
    },

    {
        "match": "report(action_status(toast_bread, done))",
        "utterance": "Great! let's continue then."
    },

    {
        "match": "report(action_status(add_sauce, done))",
        "utterance": "Great! let's continue then."
    },

        {
        "match": "report(action_status(sauce_option, done))",
        "utterance": "Now!"
    }

]